# vim:ft=ruby

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/services'

brew 'antigen'
brew 'bat'
brew 'chruby'
brew 'coreutils'
brew 'editorconfig'
brew 'git'
brew 'jq'
brew 'moreutils'
brew 'neovim'
brew 'rename'
brew 'ruby-install'
brew 'the_silver_searcher'
brew 'trash'
brew 'zsh-syntax-highlighting'

# for ruby
brew 'gdbm'
brew 'libffi'
brew 'libyaml'
brew 'openssl'
brew 'readline'

cask 'alfred'
cask 'font-source-code-pro-for-powerline'
cask 'iterm2'
cask 'java8'
cask 'vimr'

case `hostname -s`
when 'benjamins-macbook-pro'
  brew 'get_iplayer'
  brew 'npm'
  cask 'adobe-acrobat-reader'
  cask 'calibre'
  cask 'dropbox'
  cask 'foxitreader'
  cask 'papers'
  cask 'skype'
  cask 'steam'
  cask 'transmission'
  cask 'vlc'
when 'c02x937zjg5l'
  brew 'awscli'
  brew 'cassandra@2.2'
  brew 'gsl'
  brew 'libmagic'
  brew 'postgis'
  brew 'proj'
  brew 'redis'
  brew 's3cmd'
  brew 'terraform'
  cask 'chromedriver'
  cask 'google-chrome'
  cask 'postgres'
end
