# vim:ft=ruby

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap 'theseal/ssh-askpass'

brew 'antigen'
brew 'bat'
brew 'chruby'
brew 'chruby-fish'
brew 'coreutils'
brew 'dash'
brew 'diff-so-fancy'
brew 'elixir'
brew 'exa'
brew 'findutils'
brew 'fish'
brew 'ghc'
brew 'git'
brew 'gnu-sed'
brew 'jq'
brew 'moreutils'
brew 'python'
brew 'rename'
brew 'ripgrep'
brew 'ruby-install'
brew 'rust'
brew 'shellcheck'
brew 'shfmt'
brew 'ssh-askpass'
brew 'trash'
brew 'vim'
brew 'zsh-syntax-highlighting'

# for ruby
brew 'gdbm'
brew 'libffi'
brew 'libyaml'
brew 'openssl'
brew 'readline'

cask 'alfred'
cask 'dropbox'
cask 'font-fira-code'
cask 'iterm2'
cask 'java8'
cask 'macvim'
cask 'textexpander'

case `hostname -s`
when 'benjamins-macbook-pro'
  brew 'get_iplayer'
  brew 'npm'
  cask 'adobe-acrobat-reader'
  cask 'calibre'
  cask 'foxitreader'
  cask 'papers'
  cask 'skype'
  cask 'steam'
  cask 'transmission'
  cask 'vlc'
when 'c02x937zjg5l'
  brew 'awscli'
  brew 'docker-compose'
  brew 'gsl'
  brew 'libmagic'
  brew 'proj'
  brew 's3cmd'
  brew 'terraform'
  cask 'chromedriver'
  cask 'google-chrome'
end
