tap "espanso/espanso"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

brew "ansible"
brew "ansible-lint"
brew "bat"
brew "chruby"
brew "chruby-fish"
brew "coreutils"
brew "docker"
brew "docker-compose"
brew "entr"
brew "exa"
brew "fd"
brew "findutils"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "hexyl"
brew "htmlq"
brew "jq"
brew "just"
brew "logrotate"
brew "luacheck"
brew "luarocks"
brew "moreutils"
brew "mosh"
brew "neovim"
brew "pandoc"
brew "postgresql"
brew "pre-commit"
brew "pstree"
brew "pyenv"
brew "rename"
brew "ripgrep"
brew "ruby-install"
brew "rustup"
brew "shfmt"
brew "taplo"
brew "trash"
brew "tree"
brew "wget"
brew "yarn"
brew "yq"
brew "zoxide"

cask "airbuddy"
cask "alfred"
cask "bartender"
cask "dash"
cask "docker"
cask "dropbox"
cask "espanso"
cask "font-gentium-plus"
cask "font-input"
cask "hammerspoon"
cask "hookmark"
cask "hyperkey"
cask "launchcontrol"
cask "neovide"
cask "qlmarkdown"
cask "qlstephen"
cask "rectangle-pro"
cask "rocket"
cask "secretive"
cask "wezterm"
cask "zoom"

case `hostname -s`.chomp
when "MacBook-Pro"
  brew "flyctl"
  brew "get_iplayer"
  brew "go"
  brew "zola"

  cask "arq"
  cask "calibre"
  cask "firefox"
  cask "gog-galaxy"
  cask "hammerspoon"
  cask "hazel"
  cask "jettison"
  cask "mactex"
  cask "qlmobi"
  cask "qlvideo"
  cask "signal"
  cask "steam"
  cask "vlc"
  cask "zotero"
when /^Unboxed/
  tap "heroku/brew"

  brew "awscli"
  brew "heroku/brew/heroku"
  brew "imagemagick"
  brew "terraform"

  cask "breaktimer"
  cask "firefox"
  cask "google-chrome"
  cask "gpg-suite-no-mail"
  cask "session-manager-plugin"
end
