tap "espanso/espanso"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

brew "antidote"
brew "bash-language-server"
brew "bat"
brew "chruby"
brew "colima"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "docker-ls"
brew "entr"
brew "exa"
brew "fd"
brew "findutils"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "golangci-lint"
brew "gopls"
brew "gum"
brew "helix"
brew "hexyl"
brew "htmlq"
brew "jq"
brew "just"
brew "logrotate"
brew "ltex-ls"
brew "lua-language-server"
brew "luacheck"
brew "marksman"
brew "moreutils"
brew "mosh"
brew "pandoc"
brew "php" # for an alfred workflow
brew "postgresql"
brew "pre-commit"
brew "pstree"
brew "pyenv"
brew "rename"
brew "ripgrep"
brew "ruby-install"
brew "rust-analyzer"
brew "rustup"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "taplo"
brew "terraform-ls"
brew "tfenv"
brew "tflint"
brew "trash"
brew "tree"
brew "typst"
brew "vhs"
brew "wget"
brew "yaml-language-server"
brew "yarn"
brew "yq"
brew "zoxide"

cask "airbuddy"
cask "alfred"
cask "bartender"
cask "dash"
cask "dropbox"
cask "espanso"
cask "font-input"
cask "font-gentium-plus"
cask "hammerspoon"
cask "hookmark"
cask "hyperkey"
cask "launchcontrol"
cask "meld"
cask "qlmarkdown"
cask "qlstephen"
cask "rectangle-pro"
cask "rocket"
cask "secretive"
cask "wezterm"
cask "zoom"

# ruby builddeps
brew "automake"
brew "bison"
brew "capstone" # for some versions
brew "gdbm"
brew "libffi"
brew "libyaml"
brew "openssl@3"
brew "readline"

case `hostname -s`.chomp
when "MacBook-Pro"
  brew "flyctl"
  brew "get_iplayer"
  brew "go"
  brew "zola"

  cask "arq"
  cask "calibre"
  cask "firefox"
  cask "gog-galaxy"
  cask "hammerspoon"
  cask "hazel"
  cask "jettison"
  cask "qlmobi"
  cask "qlvideo"
  cask "signal"
  cask "steam"
  cask "vlc"
  cask "zotero"
when /^Ben-Eskolas-MacBook/
  tap "heroku/brew"

  brew "ansible"
  brew "ansible-language-server"
  brew "ansible-lint"
  brew "awscli"
  brew "crystal" # for trello-cli
  brew "heroku/brew/heroku"
  brew "imagemagick"

  cask "breaktimer"
  cask "firefox"
  cask "google-chrome"
  cask "gpg-suite-no-mail"
  cask "session-manager-plugin"
end
