tap "federico-terzi/espanso"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

brew "ansible"
brew "bat"
brew "chruby"
brew "chruby-fish"
brew "coreutils"
brew "dash"
brew "entr"
brew "exa"
brew "fd"
brew "findutils"
brew "fish"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "golangci/tap/golangci-lint"
brew "htmlq"
brew "jq"
brew "luarocks"
brew "moreutils"
brew "mosh"
brew "neovim"
brew "pandoc"
brew "postgresql"
brew "pstree"
brew "pyenv"
brew "rename"
brew "ripgrep"
brew "ruby-install"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "zola"
brew "zoxide"

cask "airbuddy"
cask "alfred"
cask "bartender"
cask "bettertouchtool"
cask "dash"
cask "espanso"
cask "font-gentium-plus"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "hazel"
cask "hook"
cask "iterm2"
cask "launchcontrol"
cask "lunar"
cask "neovide"
cask "qlmarkdown"
cask "qlstephen"
cask "rectangle-pro"
cask "rocket"
cask "secretive"
cask "topnotch"
cask "wezterm"

case `hostname -s`.chomp
when "MacBook-Pro"
  brew "get_iplayer"

  cask "arq"
  cask "calibre"
  cask "firefox"
  cask "gog-galaxy"
  cask "jettison"
  cask "mactex"
  cask "qlmobi"
  cask "qlvideo"
  cask "signal"
  cask "steam"
  cask "vlc"
  cask "zoom"
  cask "zotero"
when /^Unboxed/
  brew "colima"
  brew "docker"
  brew "docker-compose"

  cask "breaktimer"
  cask "docker"
end
