# -*- ruby -*-
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'

brew 'awscli'
brew 'brew-cask'
brew 'chruby'
brew 'colordiff'
brew 'coreutils'
# brew 'gcc48' # for ruby 1.9
brew 'heroku-toolbelt'
brew 'jq'
brew 'mobile-shell'
brew 'moreutils'
brew 'python3'
brew 'ruby-install'
brew 'rust'
brew 'the_silver_searcher'
brew 'tree'

cask 'alfred'
cask 'atom'
cask 'dropbox'
cask 'font-source-code-pro'
cask 'google-chrome'
cask 'iterm2'
cask 'packer' if ENV['HOSTNAME'] == 'ELSLABM-155889'
cask 'vagrant'
cask 'virtualbox'
