Gazorby/fish-abbreviation-tips
PatrickF1/fzf.fish
benjamineskola/fish-git
jethrokuan/z
jorgebucaran/autopair.fish
jorgebucaran/fisher
jorgebucaran/nvm.fish
pure-fish/pure
